{"id": "M7_B0BQPGJ9LQ", "input": {"title": "JBL Vibe Beam - True Wireless JBL Deep Bass Sound Earbuds, Bluetooth 5.2, Water & Dust Resistant, Hands-free call with VoiceAware, Up to 32 hours of battery life (White)", "bullet_points": "JBL Deep Bass Sound: Get the most from your mixes with high-quality audio from secure, reliable earbuds with 8mm drivers featuring JBL Deep Bass Sound\nComfortable fit: The ergonomic, stick-closed design of the JBL Vibe Beam fits so comfortably you may forget you're wearing them. The closed design excludes external sounds, enhancing the bass performance\nUp to 32 (8h + 24h) hours of battery life and speed charging: With 8 hours of battery life in the earbuds and 24 in the case, the JBL Vibe Beam provide all-day audio. When you need more power, you can speed charge an extra two hours in just 10 minutes.\nHands-free calls with VoiceAware: When you're making hands-free stereo calls on the go, VoiceAware lets you balance how much of your own voice you hear while talking with others\nWater and dust resistant: From the beach to the bike trail, the IP54-certified earbuds and IPX2 charging case are water and dust resistant for all-day experiences", "description": "\"Bring your sound everywhere. With bass you can feel, up to 32 total hours of battery life, and a secure, comfortable stick-closed design, the splash and dust resistant JBL Vibe Beam are designed for your daily entertainment.", "product_type": "HEADPHONES", "category_root": "Electronics", "category_sub": "Earbud Headphones", "color": "White", "size": "Small", "material": "Plastic", "style": "Earbuds", "target_audience": "", "specific_uses": "Music", "model": "JBLVBEAMWHTAM", "item_form": "", "number_of_items": "1", "included_components": "1 x JBL Vibe Beam earbuds, 1 x Charging case, 1 x Type-C to Type-A charging cable, 1 x 3 sizes of eartips, 1 x Warranty / Warning, 1 x Quick Start Guide / Safety Sheet"}, "expected": {"variants": ["Bluetooth 5.2", "White", "Up to 32 Hours Battery Life", "IP54-certified", "In-Ear", "Comfortable fit", "Speed Charging", "Hands-Free Call with VoiceAware", "Small", "Water and Dust Resistant", "Deep Bass Sound"], "use_cases": ["Daily Entertainment"], "audiences": ["-"]}, "metadata": {"module_id": "Module_07", "asin": "B0BQPGJ9LQ", "brand_name": "JBL", "split": "train"}}
{"id": "M7_B0BZYCJK89", "input": {"title": "Owala FreeSip Insulated Stainless Steel Water Bottle with Straw, BPA-Free Sports Water Bottle, Great for Travel, 24 Oz, Denim", "bullet_points": "24-ounce insulated stainless-steel water bottle with a FreeSip spout and push-button lid with lock\nPatented FreeSip spout designed for either sipping upright through the built-in straw or tilting back to swig from the spout opening\nProtective push-to-open lid keeps spout clean; convenient carry loop doubles as a lock\nDouble-wall insulation keeps drinks cold for up to 24 hours; wide opening for cleaning and adding ice; cup holder-friendly base\nBPA, lead, and phthalate-free; hand wash cup, dishwasher-safe lid; not for use with hot liquids", "description": "The Owala FreeSip Insulated Stainless-Steel Water Bottle with Locking Push-Button Lid easily tackles every thirst. With a built-in, easy-clean straw and a wide-mouth opening, the FreeSip reusable bottle is designed for drinking two different ways: sipping upright through the straw or tilting back to swig from the wide-mouth spout opening. Add in a push-to-open lid and playful colors, and staying hydrated has never been simpler—or more fun. Additional features include double-wall insulated stainless steel that keeps drinks cold up to 24 hours, a carry loop that doubles as a lock, a cup holder-friendly base, and a wide opening for easy cleaning and adding ice. The Owala FreeSip Insulated Stainless-Steel Water Bottle with Locking Push-Button Lid is available in three sizes: 24-Ounce, 32-Ounce, and 40-Ounce. Lid is dishwasher safe; hand wash cup. Not for use with hot liquids. Manufacturer’s limited lifetime warranty.", "product_type": "BOTTLE", "category_root": "Home & Kitchen", "category_sub": "Thermoses, Travel & To-Go Drinkware", "color": "Denim", "size": "24 Ounces", "material": "Stainless Steel", "style": "Water Bottle", "target_audience": "", "specific_uses": "", "model": "C06060", "item_form": "", "number_of_items": "1", "included_components": "Water Bottle"}, "expected": {"variants": ["BPA-Free", "24 Ounce", "Wide Opening", "Stainless Steel", "Dishwasher-Safe Lid", "FreeSip Spout", "Denim", "Carry Loop with Lock", "Double-Wall Insulation", "Push-Button Lid and Lock", "Cup Holder-Friendly Base", "Hand Wash Cup"], "use_cases": ["General Hydration", "Sports", "Travel"], "audiences": ["-"]}, "metadata": {"module_id": "Module_07", "asin": "B0BZYCJK89", "brand_name": "Owala", "split": "train"}}
{"id": "M7_B0CJ4WZXQF", "input": {"title": "Cisily Kitchen Sink Caddy Organzier with High Brush Holder, Sponge Holder for Sink, 304 Rustproof Stainless, Kitchen Countertop Soap Dispenser Organizer, Kitchen Decor and Accessories", "bullet_points": "304 Stainless Steel\nQuality Control 100%\n【AUTOMATIC DRAINAGE SYSTEM】Cisily adopts slope design to achieve perfect drainage effect, aiming at reducing the frequency and time of cleaning the sponge holder, freeing your hands, reducing the burden on your kitchen work, and improving your happiness index.\n【PREMIUM STURDY MATERIAL】 Cisily kitchen sink organizer is made of premium stainless steel which can effectively prevent rust and deformation. And you can clean it easily by rinsing it under a running tap. Take the clutter out of your countertops.\n【REASONABLE DIVIDER DESIGN】 The sponge holder for kitchen sink ergonomic divider design allows it to have 3 separate storage spaces, Different items are placed in different areas. Make the most of every inch of space and make your kitchen look cleaner.\n【SATISFACTION GUARANTEED】The CISILY kitchen sink organizer is ready to use upon receipt, no installation required and is widely used on counters or bathrooms, making it a satisfying gift. If you have any questions during use, please consult our customer service staff. We want to provide you with a pleasant shopping experience.\nUS Patent Number:：1038566S", "description": "", "product_type": "CADDY", "category_root": "Home & Kitchen", "category_sub": "Kitchen Storage & Organization Accessories", "color": "Black", "size": "9.25″", "material": "Stainless Steel", "style": "English", "target_audience": "", "specific_uses": "Save space,Kitchen storage and organizer", "model": "XM-CA-BLACK", "item_form": "", "number_of_items": "1", "included_components": "32 DE"}, "expected": {"variants": ["Automatic Draining System / Self-draining", "Black", "304 Stainless Steel", "Large Capacity", "High Brush Holder", "Rustproof", "Sturdy", "Ergonomic Partition Design", "Stainless Steel", "Sponge Holder", "No Installation Required", "Soap Dispenser Organizer", "3 x Storage Space", "9.25 in"], "use_cases": ["Gifts", "Bathrooms", "Kitchen Countertop", "Kitchen"], "audiences": []}, "metadata": {"module_id": "Module_07", "asin": "B0CJ4WZXQF", "brand_name": "Cisily", "split": "train"}}
{"id": "M7_B0D6YNWLTS", "input": {"title": "Pioneer Camp Mens Lightweight Packable Puffer Jacket Winter Insulated Puffy Coat Water Repellent Warm Quilted Jackets Travel（Black;M）", "bullet_points": "WINDPROOF & WARM The stand collar lightweight puffer jacket is made with windproof, soft nylon fabric to block out cold air and keep you warm. The new winter jacket features elastic cuffs and an adjustable hem, effectively preventing wind from entering and ensuring fit, protecting you in cold weather. The front center zipper has dual side zipper chin guard, providing close-fitting comfort\nWATER-RESISTANT & BREATHABLE The outer layer uses DWR technology with a waterproof rating of 3000mm. The interior is filled with polyester fiber eco-friendly down alternative material, offering enhanced warmth and breathability. This men's down alternative jacket keeps your core comfortable and dry in light rain, helping you stay warm and fight against harsh rainy or misty weather\nLIGHTWEIGHT & PACKABLE DESIGN Ultra-lightweight, weightless experience, weighing only 300g.The men's stand-up collar puffer jacket can be quickly stored and placed in a waterproof storage bag. The storage bag has a drawstring and drawcord, allowing you to attach the jacket to your backpack. Our men's foldable, lightweight insulated puffer coat is ideal for casual wear and outdoor. The lightweight packable design takes up minimal space in your luggage and backpack, making travel stress-free\n4 POCKETS The men's puffy quilted jacket includes 2 external zippered hand warmer pockets and 2 large internal pockets, perfect for storing money, keys, phone, wallet, passport, and other items, providing great privacy and convenience\nOCCASION Suitable for travelling, camping, hiking, skiing, snowboarding, golf and many other outdoor activities, also good choice for casual life such as work, party, men's outerwear jackets & coats for spring fall winter. Best gifts for son, father, husband, friends,father's day gifts, birthday present, a dad gifts, Christmas gift idea etc", "description": "", "product_type": "COAT", "category_root": "Clothing, Shoes & Jewelry", "category_sub": "Down & Down Alternative", "color": "Black", "size": "Medium", "material": "Nylon", "style": "Modern", "target_audience": "", "specific_uses": "", "model": "", "item_form": "", "number_of_items": "", "included_components": ""}, "expected": {"variants": ["Quilted", "Medium", "Breathable", "Black", "Elastic Cuffs", "Lightweight", "Nylon", "4 Pockets", "Packable", "Water Repellent", "Chin Guard", "Machine Wash", "Warm", "Windproof", "Insulated"], "use_cases": ["Camping", "Casual Wear", "Skiing", "Work", "Hiking", "Party", "Winter", "Snowboarding", "Travel", "Golf", "Men's outerwear jackets"], "audiences": ["Men", "Hikers"]}, "metadata": {"module_id": "Module_07", "asin": "B0D6YNWLTS", "brand_name": "Pioneer Camp", "split": "train"}}
{"id": "M7_B0DSHWLXG6", "input": {"title": "Jikasho Vacuum Magnetic Suction Phone Holder, Foldable and Retractable Hands-Free Suction Cup Phone Mount for Car/Gym/Mirror/Smooth Surface, Compatible with iPhone Android and All Smartphones (Black)", "bullet_points": "Vacuum Lock + Gel Base — For Smooth, Flat Surfaces: Features a rotary vacuum-lock and 4-layer washable gel base that forms a rock-solid hold on flat, non-textured surfaces such as glass, glossy dashboards, or hard leather. Avoid use on curved, soft, or textured materials. To install, firmly press the gel base and rotate the vacuum lock clockwise until tight\nWashable Gel Base — Restores Grip After Rinsing: The reusable nano-gel base maintains strong adhesion when clean. If suction weakens due to dust or dirt, simply rinse the gel with water and let it air dry—this restores up to 99% of its original stickiness, and built to withstand -40°F to 194°F\n360° Customizable Viewing Angle: Achieve full viewing flexibility with triple-axis adjustment—360° swivel, 180° tilt, and foldable arm positioning. Effortlessly switch between portrait and landscape modes. Built-in zinc alloy hinges rated for 7,000+ adjustments\nUnmatched Magnetic Grip for Safe Driving: Upgraded with 24 N52 magnets in a dual-ring layout for ultra-strong, stable hold—even on bumpy roads. No signal interference. Designed for MagSafe iPhones and cases; includes magnetic rings for wider phone compatibility\nWide Device Compatibility & Instant Setup: Supports iPhone 12–17 and other smartphones with the included magnetic ring. Mounts firmly to dashboards, mirrors, windows, or smooth tile—ideal for your car, home, or studio. Setup takes seconds. Do not use on armor, silicone, leather, suede, or uneven phone cases, as the magnetic ring may not adhere securely", "description": "", "product_type": "PORTABLE_ELECTRONIC_DEVICE_MOUNT", "category_root": "Cell Phones & Accessories", "category_sub": "Cradles", "color": "Black", "size": "Compact", "material": "Metallic Finish, TPU High-Temperature Resistant Materials, Polycarbonate, Acrylonitrile Butadiene Styrene", "style": "Car Phone Holder", "target_audience": "", "specific_uses": "", "model": "magnetic car phone holder", "item_form": "", "number_of_items": "1", "included_components": "Magnetic Suction Phone Mount, Cleaning Pack, Metal Ring, User Manual"}, "expected": {"variants": ["Vacuum-lock suction mechanism", "Washable nano-gel base", "Foldable and retractable arm", "360° swivel with 180° tilt adjustment", "Triple-axis hinge design (7,000+ adjustments)", "24 N52 magnet dual-ring system", "MagSafe-compatible magnetic mount", "Includes magnetic rings for non-MagSafe phones", "Heat and cold resistant (-40°F to 194°F)", "Black color"], "use_cases": ["hands-free driving navigation", "dashboard or windshield phone mounting", "gym and workout phone viewing", "mirror-mounted content recording", "home or studio phone mounting", "travel and road trip use", "Iphone", "Android", "Smartphone"], "audiences": ["drivers", "rideshare drivers", "gym users", "content creators", "remote workers", "iPhone and Android smartphone users"]}, "metadata": {"module_id": "Module_07", "asin": "B0DSHWLXG6", "brand_name": "Jikasho", "split": "train"}}
{"id": "M7_B0CVQJY9C6", "input": {"title": "ENFit® Syringe - 20ml - QTY 10", "bullet_points": "ENFit\nStandard ENFit Tip\nClear Barrel", "description": "ENFit Syringe", "product_type": "SYRINGE", "category_root": "Industrial & Scientific", "category_sub": "Syringes", "color": "Purple", "size": "", "material": "Plastic", "style": "20ml", "target_audience": "", "specific_uses": "", "model": "", "item_form": "", "number_of_items": "", "included_components": ""}, "expected": {"variants": ["ENFit", "20 ml capacity", "Qty 10 pack", "Standard ENFit tip", "Clear barrel", "Non-sterile", "Plastic"], "use_cases": ["Enteral tube feeding", "ENFit connector syringe use"], "audiences": ["Patients requiring enteral feeding", "Caregivers administering tube feeds", "Clinical users in healthcare settings"]}, "metadata": {"module_id": "Module_07", "asin": "B0CVQJY9C6", "brand_name": "Rx Crush", "split": "train"}}
{"id": "M7_B0F42MT8JX", "input": {"title": "Countertop Ice Maker Machine, 8 Ice Cubes in 6 mins, 26lb/Day Ice with 2 Sizes- Portable Mini, Energy Saving & Basket/Scoop for Home/Party/Travel/Camping/Bar,Black", "bullet_points": "Eco-Conscious Performance‌:The ice maker uses an optimized motor and streamlined construction to cut energy consumption by 30%. Lower carbon footprint + save on energy bills – sustainability meets smart spending.\nTurbo Ice Machine:Chill drinks in just 6 minutes – 26lbs of ice a day capacity crushes summer heat anxiety. Keep the drinks flowing at pool parties, BBQs, or sudden guest arrivals.\nSelf-Cleaning Care‌:One-touch maintenance cycle keeps ice tasting fresh. No more funky ice odors! Simply activate weekly (or after 2-week inactivity) for crystal-clear ice you can trust.\nRoad Trip-Ready Compactness‌:Fits anywhere with 8.66\"x10.39\"x11.22\" footprint – Throw a countertop ice maker in your RV, tailgate setup, or beach cabana. Your ultimate hydration sidekick for adventures.\nLibrary-Quiet Operation‌:Whisper-quiet tech at <40dB – Talk, work, or binge undisturbed. Our acoustic engineers obsess over every decibel. So is our ice machine.", "description": "", "product_type": "ICE_MAKER", "category_root": "Appliances", "category_sub": "Ice Makers", "color": "Dark Black", "size": "26Lbs/24H", "material": "Plastic", "style": "", "target_audience": "", "specific_uses": "", "model": "58012RIMO-NJ3-BLACK", "item_form": "", "number_of_items": "1", "included_components": "ice maker, basket, scoop, handle"}, "expected": {"variants": ["8 ice cubes in 6 minutes", "26 lb daily ice production", "Two ice cube sizes", "Portable countertop form factor", "Compact footprint (8.66 x 10.39 x 11.22 inches)", "Energy-saving motor (30% reduced consumption)", "Self-cleaning function", "Quiet operation under 40 dB", "Includes ice basket and scoop", "Black color finish"], "use_cases": ["home kitchen ice making", "party and entertaining use", "BBQ and poolside drinks", "travel and RV use", "camping and outdoor trips", "bar and beverage preparation"], "audiences": ["homeowners", "party hosts", "frequent entertainers", "travelers and campers", "RV owners", "energy-conscious consumers"]}, "metadata": {"module_id": "Module_07", "asin": "B0F42MT8JX", "brand_name": "Antarctic Star", "split": "train"}}
{"id": "M7_B000H3I2JG", "input": {"title": "Revlon ColorStay Pencil Waterproof Eyeliner, Smudge-Proof, Eye Makeup with Built-In Sharpener, Stocking Stuffer for Women, 202 Black Brown, 0.01 oz", "bullet_points": "LASTING LINES: Rich color looks freshly applied all day long; transfer-proof, waterproof, smudge-proof and fade-proof\nUP TO 24HR WEAR: Creates the look you want and stays on strong\nEASY APPLICATION: Glides on, creating intensely defined lines that can go from subtle to dramatic. Includes built-in sharpener for the perfect pointed tip and a smudger to blend.\nTWO FINISHES: Available in 12 totally wearable matte and shimmer shades\nOPHTHALMOLOGIST TESTED: Suitable for use on waterline and comfortable to wear", "description": "Product Description\n\nAmerica’s #1 Longwear Eyeliner.* Revlon ColorStay Eyeliner Pencil delivers rich, lasting color that looks freshly applied all day long, and glides on smoothly in totally wearable, everyday shades. Whether you want to go subtle or dramatic, this eyeliner pencil creates the look you want and stays on strong. Formulated with ColorStay Adapti-Flex Color Lock Technology™. Waterproof, smudge-proof, fade-proof, and transfer-proof. Up to 24HR wear. Plus, it has a built-in sharpener and smudger. *Revlon Consumer Products Corporation’s calculation based in part on data reported by Circana, LLC, through its OmniMarket Service of Total US Multi-Outlet for Makeup Category, Eyeliner Subcategory for the 52-week period ending 11-24-2024 using Revlon’s custom definitions.\n\nBrand Story\n\nBy Revlon", "product_type": "EYELID_COLOR", "category_root": "Beauty & Personal Care", "category_sub": "Eyeliner", "color": "Black Brown", "size": "0.01 Ounce (Pack of 1)", "material": "", "style": "", "target_audience": "women", "specific_uses": "", "model": "309973978010", "item_form": "", "number_of_items": "1", "included_components": ""}, "expected": {"variants": ["Waterproof formula", "Smudge-proof and transfer-proof wear", "Up to 24-hour wear", "Pencil eyeliner format", "Built-in sharpener", "Built-in smudger", "Black Brown shade (202)", "Matte and shimmer finish options", "Ophthalmologist tested", "ColorStay longwear technology"], "use_cases": ["all-day eye makeup wear", "waterline application", "subtle everyday makeup looks", "dramatic eye definition", "long-lasting makeup for events or travel"], "audiences": ["women makeup users", "long-wear makeup seekers", "everyday makeup wearers", "beauty enthusiasts", "gift and stocking stuffer shoppers"]}, "metadata": {"module_id": "Module_07", "asin": "B000H3I2JG", "brand_name": "REVLON", "split": "train"}}
{"id": "M7_B08J8GZXKZ", "input": {"title": "KITCHENAID Ribbed Soft Silicone Oven Mitt 2-Pack Set, 7.5\"x13\", Milkshake", "bullet_points": "DURABLE, HEAT RESISTANT SILICONE - The Kitchen Aid Ribbed Soft Silicone mitts are heat resistant up to 500 degrees Fahrenheit to safely shield hands from the heat while cooking and handling hot pans and dishes.\nWATERPROOF & SLIP-RESISTANT - These silicone mitts are water resistant for additional protection from hot spills and spots with a textured, ribbed stripe design for a safe and secure grip.\nSET OF TWO- Includes two (2) generously sized oven mitts that each measures 7\" wide x 13\" long for a comfortable fit.\nADDITIONAL PROTECTION & COMFORT - The 100% cotton cuff provides additional protection from the heat with polyester lining that offers comfort and insulation.\nEASY CARE - These Kitchen Aid oven mitts can be easily cleaned. Simply rinse off with water and wipe them clean.", "description": "Perform your kitchen tasks safely with the Kitchen Aid Ribbed Soft Silicone 2-Piece Oven Mitt Set. The textured, ribb stripe design offers a secure grip while handling hot objects. Made of durable and waterproof silicone with a cotton cuff that provides additional shield from the heat and polyester lining that offers comfort and insulation. Each oven mitt measures 7 inches by 13 inches for a generous fit. They are heat resistant up to 500 degrees Fahrenheit. Coordinate these oven mitts with coordinating Kitchen Aid Ribbed Soft Silicone Pot Holders for a complete set.", "product_type": "POT_HOLDER", "category_root": "Home & Kitchen", "category_sub": "Oven Mitts", "color": "Milkshake", "size": "7.5\"x13\"", "material": "silicone", "style": "Oven Mitt Set", "target_audience": "", "specific_uses": "", "model": "O2013117TDKA 205", "item_form": "", "number_of_items": "1", "included_components": ""}, "expected": {"variants": ["Heat resistant up to 500°F", "Soft ribbed silicone exterior", "Waterproof silicone material", "Slip-resistant textured grip", "2-pack set", "7.5 x 13 inch size", "Cotton cuff", "Polyester lining", "Milkshake color"], "use_cases": ["oven cooking and baking", "handling hot pans and dishes", "grilling and stovetop cooking", "kitchen heat protection", "everyday kitchen use"], "audiences": ["home cooks", "baking enthusiasts", "frequent kitchen users", "safety-conscious cooks", "KitchenAid brand loyalists"]}, "metadata": {"module_id": "Module_07", "asin": "B08J8GZXKZ", "brand_name": "KitchenAid", "split": "train"}}
{"id": "M7_B09LCKZBTW", "input": {"title": "Webacoo Bamboo Tray with Handles - Lightweight Serving Tray for Breakfast in Bed, Coffee Table, BBQ, Kitchen, Ottoman & Party - Perfect for Lap, Couch & Gifting - Large Size Wood Tea Tray - 15”x10”", "bullet_points": "🌿 Serve with Webacoo Style: Elevate your dining experience! Whether serving breakfast in bed, organizing snacks on a coffee table, hosting a BBQ party, or displaying decor on your ottoman, this bamboo tray combines practicality with rustic charm. Its versatile design fits seamlessly into kitchens, living rooms, patios, and even commercial settings.\n🌿 Premium Eco-Friendly Bamboo Construction: Crafted from 100% natural, heat-treated bamboo, Webacoo’s serving tray is stronger and more durable than plastic alternatives. Sanded smooth and coated with food-safe oil, it resists stains, splinters, and wear—ideal for daily use and heavy-duty occasions.\n🌿 Ergonomic Handles & Lightweight Design: Sleek, low-profile handles ensure a secure grip, even when fully loaded. At just 15.3” x 9.8”, this lightweight yet sturdy tray effortlessly carries meals, drinks, or decor from room to room. Raised edges prevent spills, keeping items firmly in place.\n🌿 Multipurpose for Home & Beyond: Use it as a breakfast platter, snack organizer, coffee table centerpiece, or decorative storage for keys and remotes. Its minimalist bohemian style also makes it perfect for candle displays, plant holders, or wall art.\n🌿 Easy-Clean & Gift-Ready: Simply wipe with a damp cloth for instant maintenance. With its timeless design and eco-conscious appeal, this bamboo tray is an ideal gift for weddings, housewarmings, birthdays, or Christmas—sure to delight friends, family, or even yourself!\n🌿 Why Choose Us? Durable, lightweight, and endlessly versatile, this bamboo serving tray is designed to last. Upgrade your home or commercial space with a piece that blends functionality, sustainability, and modern elegance.", "description": "", "product_type": "TRAY", "category_root": "Home & Kitchen", "category_sub": "Serving Trays", "color": "Bamboo", "size": "15.3\" x 11.2\" x 1\"", "material": "Bamboo", "style": "Classic", "target_audience": "", "specific_uses": "", "model": "TS000", "item_form": "", "number_of_items": "1", "included_components": ""}, "expected": {"variants": ["15” x 10” large size", "Natural bamboo construction", "Eco-friendly material", "Lightweight design", "Ergonomic built-in handles", "Raised spill-prevention edges", "Heat-treated bamboo", "Food-safe oil finish", "Rustic minimalist style"], "use_cases": ["breakfast in bed serving", "coffee table snack serving", "BBQ and party serving", "kitchen and dining use", "ottoman and couch tray use", "decorative home organization", "gifting for special occasions"], "audiences": ["homeowners", "eco-conscious consumers", "hosts and entertainers", "apartment dwellers", "gift buyers", "home decor enthusiasts"]}, "metadata": {"module_id": "Module_07", "asin": "B09LCKZBTW", "brand_name": "WEBACOO", "split": "train"}}
{"id": "M7_B077YYP739", "input": {"title": "Transformers Toys Heroic Optimus Prime Action Figure - Timeless Large-Scale Figure, Changes into Toy Truck - Toys for Kids 6 and Up, 11-inch (Amazon Exclusive)", "bullet_points": "EXPERIENCE THE CLASSIC CONVERSION PLAY OF TRANSFORMERS TOYS: Transformers toys that change from robot to vehicle have captivated kids for generations.\n2 TOYS IN 1: This toy robot changes into the signature red and blue Optimus Prime toy truck in 6 simple steps. Easy conversion for kids 6 years old and up.\nFAVORITE TRANSFORMERS CHARACTER: Transformers follows the story of the heroic Autobots, who fight to protect all life, and the evil Decepticons, who seek to conquer the universe. This timeless 11-inch Cyber Commander Series figure depicts Optimus Prime, legendary leader of the Autobots--essential when starting a Transformers toy collection.\nIMAGINE EXCITING BATTLES: Collect other 11-inch Cyber Commander Series Transformers figures so kids can imagine their own Autobot vs. Decepticon battles (Each sold separately. Subject to availability).\nMAKES A GREAT GIFT: This classic Optimus Prime action figure makes the perfect birthday or holiday gift.", "description": "Bring home the excitement of Transformers robots with this Cyber Commander series Optimus Prime figure! The Transformers are sentient robots from the distant planet, Cybertron. Two factions, the heroic Autobots and the evil Decepticons are in an ever-raging battle. The legendary Autobot leader, Optimus Prime, fights to defend all life, while his nemesis, the merciless Decepticon leader, Megatron, fights to destroy it. This timeless 11-inch scale Transformers Optimus Prime figure is essential when starting a Transformers toy collection. Featuring classic Transformers conversion for kids 6 and up, kids can change this Optimus Prime action figure from toy robot to toy truck in 6 easy steps. Collect other Cyber Commander Series figures so kids can create their own Autobot vs. Decepticon battles and imagine Optimus Prime leading the heroic Autobots against the evil Decepticons! (Each sold separately. Subject to availability). Transformers and all related characters are trademarks of Hasbro.", "product_type": "TOY_FIGURE", "category_root": "Toys & Games", "category_sub": "Action Figures, Collectible Toys", "color": "Blue, Red, Gray", "size": "11 inch(Pack of 1)", "material": "Plastic", "style": "Action Figure", "target_audience": "boys", "specific_uses": "", "model": "C2001", "item_form": "", "number_of_items": "1", "included_components": "Figure and on-pack instructions."}, "expected": {"variants": ["11-inch large-scale figure", "Optimus Prime character", "Robot-to-truck transformation", "2-in-1 transforming toy", "6-step easy conversion", "Cyber Commander Series", "Red and blue truck mode", "Amazon Exclusive"], "use_cases": ["imaginative play", "Autobot vs. Decepticon battle play", "toy collection building", "birthday and holiday gifting"], "audiences": ["kids ages 6 and up", "Transformers fans", "young action figure collectors"]}, "metadata": {"module_id": "Module_07", "asin": "B077YYP739", "brand_name": "Transformers", "split": "train"}}
{"id": "M7_B0C9SPJ9ZQ", "input": {"title": "35 ml RxCrush ENFit Syringe - Qty 10", "bullet_points": "Vesco ENFit syringes.\nStandard Tip", "description": "ENFit Syringe. Female tip with purple plunger.Use instead of Luer, Oral, or Catheter syringes for tube feeding.ISO 80369-3 compliant. No cap with syringe. See CA06.Materials: PP, Isoprene.Use with RxCrush Pill Pouches or ENFit feeding tubes and extension sets.Single patient use and Rx only.", "product_type": "PROFESSIONAL_HEALTHCARE", "category_root": "Industrial & Scientific", "category_sub": "Syringes", "color": "", "size": "35 ml", "material": "", "style": "Standard ENFit", "target_audience": "", "specific_uses": "", "model": "", "item_form": "", "number_of_items": "10", "included_components": ""}, "expected": {"variants": ["ENFit", "35 ml capacity", "Qty 10 pack", "Female tip", "Standard tip", "Purple plunger", "ISO 80369-3 compliant", "Non-sterile", "Plastic (PP, Isoprene)", "No cap included", "Single patient use", "Rx only"], "use_cases": ["Tube feeding", "Replacing Luer/oral/catheter syringes for enteral use", "Medication administration via feeding tube", "Use with RxCrush pill pouches", "Use with ENFit feeding tubes", "Use with ENFit extension sets"], "audiences": ["Patients requiring enteral feeding", "Caregivers administering tube feeds/medications", "Clinical users in healthcare settings", "Prescription purchasers"]}, "metadata": {"module_id": "Module_07", "asin": "B0C9SPJ9ZQ", "brand_name": "Rx Crush", "split": "train"}}
